In [51]:
# Basic dataset exercise
x <- 1:8
name <- c("Embryo Luo", "", "Peter Smith", NA, "Angela Peterson", "Emily Johnston", "Barbara Scott", "Benjamin Eng")
gender <- c("M", "F", "M", "F", "F", "F", "?", "M")
age <- c(-1, 25, 22, 50, 30, 42, 29, 36)
exams <- c(10, 3, 0, 4, 6, 7, 5, 9)
Q1 <- c(10, NA, 4, 7, 8, 9, 8, 7)
Q2 <- c(9, 9, 5, 7, 8, 10, 9, 8)
Q3 <- c(9, 7, 5, 8, 10, 10, 7, 8)
salary <- c(300000, NA, 80000, NA, NA, NA, NA, NA)

actuary <- data.frame(x, name, gender, age, exams, Q1, Q2, Q3, salary)
actuary

  x name            gender age exams Q1 Q2 Q3 salary
1 1 Embryo Luo      M      -1  10    10  9  9 3e+05
2 2                 F      25   3    NA  9  7    NA
3 3 Peter Smith     M      22   0     4  5  5 8e+04
4 4 NA              F      50   4     7  7  8    NA
5 5 Angela Peterson F      30   6     8  8 10    NA
6 6 Emily Johnston  F      42   7     9 10 10    NA
7 7 Barbara Scott   ?      29   5     8  9  7    NA
8 8 Benjamin Eng    M      36   9     7  8  8    NA

In [52]:
# Removing unneeded variables
actuary$x <- NULL
actuary

  name            gender age exams Q1 Q2 Q3 salary
1 Embryo Luo      M      -1  10    10  9  9 3e+05
2                 F      25   3    NA  9  7    NA
3 Peter Smith     M      22   0     4  5  5 8e+04
4 NA              F      50   4     7  7  8    NA
5 Angela Peterson F      30   6     8  8 10    NA
6 Emily Johnston  F      42   7     9 10 10    NA
7 Barbara Scott   ?      29   5     8  9  7    NA
8 Benjamin Eng    M      36   9     7  8  8    NA

In [53]:
# Missing / Abnormal values
actuary$salary <- NULL
actuary     # removes salary

# logical subsetting to remove NA from Q1
is.na(actuary$Q1)
actuary.1 <- actuary[!is.na(actuary$Q1), ]
actuary.1

# complete cases and na omit -> 2 other ways to remove NA rows:

cc <- complete.cases(actuary)
actuary.2 <- actuary[cc, ]
actuary.2

actuary.3 <- na.omit(actuary)
actuary.3

  name            gender age exams Q1 Q2 Q3
1 Embryo Luo      M      -1  10    10  9  9
2                 F      25   3    NA  9  7
3 Peter Smith     M      22   0     4  5  5
4 NA              F      50   4     7  7  8
5 Angela Peterson F      30   6     8  8 10
6 Emily Johnston  F      42   7     9 10 10
7 Barbara Scott   ?      29   5     8  9  7
8 Benjamin Eng    M      36   9     7  8  8

[1] FALSE  TRUE FALSE FALSE FALSE FALSE FALSE FALSE

  name            gender age exams Q1 Q2 Q3
1 Embryo Luo      M      -1  10    10  9  9
3 Peter Smith     M      22   0     4  5  5
4 NA              F      50   4     7  7  8
5 Angela Peterson F      30   6     8  8 10
6 Emily Johnston  F      42   7     9 10 10
7 Barbara Scott   ?      29   5     8  9  7
8 Benjamin Eng    M      36   9     7  8  8

  name            gender age exams Q1 Q2 Q3
1 Embryo Luo      M      -1  10    10  9  9
3 Peter Smith     M      22   0     4  5  5
5 Angela Peterson F      30   6     8  8 10
6 Emily Johnston  F      42   7     9 10 10
7 Barbara Scott   ?      29   5     8  9  7
8 Benjamin Eng    M      36   9     7  8  8

  name            gender age exams Q1 Q2 Q3
1 Embryo Luo      M      -1  10    10  9  9
3 Peter Smith     M      22   0     4  5  5
5 Angela Peterson F      30   6     8  8 10
6 Emily Johnston  F      42   7     9 10 10
7 Barbara Scott   ?      29   5     8  9  7
8 Benjamin Eng    M      36   9     7  8  8

In [54]:
# continue to work with .3 version, rename as .n version

actuary.n <- actuary.3  # cleaned dataset
actuary.n 

# number of removed rows: 
nrow(actuary) - nrow(actuary.n)

  name            gender age exams Q1 Q2 Q3
1 Embryo Luo      M      -1  10    10  9  9
3 Peter Smith     M      22   0     4  5  5
5 Angela Peterson F      30   6     8  8 10
6 Emily Johnston  F      42   7     9 10 10
7 Barbara Scott   ?      29   5     8  9  7
8 Benjamin Eng    M      36   9     7  8  8

[1] 2

In [55]:
# Adding variables
# Adding a var called S, which averages the 3 Q evaluations. 

actuary.n$S <- (actuary.n$Q1 + actuary.n$Q2 + actuary.n$Q3) / 3
actuary.n

  name            gender age exams Q1 Q2 Q3 S
1 Embryo Luo      M      -1  10    10  9  9 9.333333
3 Peter Smith     M      22   0     4  5  5 4.666667
5 Angela Peterson F      30   6     8  8 10 8.666667
6 Emily Johnston  F      42   7     9 10 10 9.666667
7 Barbara Scott   ?      29   5     8  9  7 8.000000
8 Benjamin Eng    M      36   9     7  8  8 7.666667

In [56]:
# an easier way to perform the above using the apply function:
actuary.n$S <- apply(actuary.n[, c("Q1", "Q2", "Q3")], 1, mean)
actuary.n

  name            gender age exams Q1 Q2 Q3 S
1 Embryo Luo      M      -1  10    10  9  9 9.333333
3 Peter Smith     M      22   0     4  5  5 4.666667
5 Angela Peterson F      30   6     8  8 10 8.666667
6 Emily Johnston  F      42   7     9 10 10 9.666667
7 Barbara Scott   ?      29   5     8  9  7 8.000000
8 Benjamin Eng    M      36   9     7  8  8 7.666667

In [57]:
# finding the means of the columns: 
apply(actuary.n[, c("Q1", "Q2", "Q3")], 2, mean)

# finding max and min
actuary.n[which.max(actuary.n$S), "name"]
actuary.n[which.min(actuary.n$S), "name"]

# Sort S in ascending order
actuary.n1 <- actuary.n[order(actuary.n$S), ]

# sort in descending
actuary.n2 <- actuary.n[order(actuary.n$S, decreasing = TRUE), ]

actuary.n1
actuary.n2

      Q1       Q2       Q3
7.666667 8.166667 8.166667

[1] "Emily Johnston"

[1] "Peter Smith"

  name            gender age exams Q1 Q2 Q3 S
3 Peter Smith     M      22   0     4  5  5 4.666667
8 Benjamin Eng    M      36   9     7  8  8 7.666667
7 Barbara Scott   ?      29   5     8  9  7 8.000000
5 Angela Peterson F      30   6     8  8 10 8.666667
1 Embryo Luo      M      -1  10    10  9  9 9.333333
6 Emily Johnston  F      42   7     9 10 10 9.666667

  name            gender age exams Q1 Q2 Q3 S
6 Emily Johnston  F      42   7     9 10 10 9.666667
1 Embryo Luo      M      -1  10    10  9  9 9.333333
5 Angela Peterson F      30   6     8  8 10 8.666667
7 Barbara Scott   ?      29   5     8  9  7 8.000000
8 Benjamin Eng    M      36   9     7  8  8 7.666667
3 Peter Smith     M      22   0     4  5  5 4.666667

In [58]:
# Logical tests to parse data
actuary.FSA <- actuary.n[actuary.n$exams == 10, ]
actuary.FSA

actuary.ASA <- actuary.n[actuary.n$exams >= 7 & actuary.n$exams <= 9, ]
actuary.ASA

nrow(actuary.FSA)
nrow(actuary.ASA)

  name       gender age exams Q1 Q2 Q3 S
1 Embryo Luo M      -1  10    10 9  9  9.333333

  name           gender age exams Q1 Q2 Q3 S
6 Emily Johnston F      42  7     9  10 10 9.666667
8 Benjamin Eng   M      36  9     7   8  8 7.666667

[1] 1

[1] 2

In [59]:
# Organizing & more logical tests
actuary.n$title <- ifelse(actuary.n$exams ==10, "FSA", 
                            ifelse(actuary.n$exams >= 7 & actuary.n$exams <= 9, 
                                    "ASA", "student"))

actuary.n

  name            gender age exams Q1 Q2 Q3 S        title
1 Embryo Luo      M      -1  10    10  9  9 9.333333 FSA
3 Peter Smith     M      22   0     4  5  5 4.666667 student
5 Angela Peterson F      30   6     8  8 10 8.666667 student
6 Emily Johnston  F      42   7     9 10 10 9.666667 ASA
7 Barbara Scott   ?      29   5     8  9  7 8.000000 student
8 Benjamin Eng    M      36   9     7  8  8 7.666667 ASA

In [60]:
# cbind and rbind are used to attach columns or rows to an existing dataframe
new <- data.frame(smoke = c("N", "N", "Y", "Y", "N", "N", "N", "Y"), 
                  weight = c(70, 65, 60, 90, 60, 55, 50, 75))

actuary.n <- cbind(actuary.n, new[cc, ])
actuary.n

  name            gender age exams Q1 Q2 Q3 S        title   smoke weight
1 Embryo Luo      M      -1  10    10  9  9 9.333333 FSA     N     70
3 Peter Smith     M      22   0     4  5  5 4.666667 student Y     60
5 Angela Peterson F      30   6     8  8 10 8.666667 student N     60
6 Emily Johnston  F      42   7     9 10 10 9.666667 ASA     N     55
7 Barbara Scott   ?      29   5     8  9  7 8.000000 student N     50
8 Benjamin Eng    M      36   9     7  8  8 7.666667 ASA     Y     75

In [66]:
# Compound Variables
# paste function is very useful

paste("Hello", "There!")

paste(c("a", "b", "c"), c("x", "y", "z"), sep = "")

paste("The answer is", c("YES", "NO"))

paste0("Yr", 1:10)

paste("The answer is", c("YES", "NO"), sep = "...", collapse = " OR ")

[1] "Hello There!"

[1] "ax" "by" "cz"

[1] "The answer is YES" "The answer is NO"

 [1] "Yr1"  "Yr2"  "Yr3"  "Yr4"  "Yr5"  "Yr6"  "Yr7"  "Yr8"  "Yr9"  "Yr10"

[1] "The answer is...YES OR The answer is...NO"

In [67]:
# testing paste with dataset
actuary.n$genderSmoke <- paste0(actuary.n$gender, actuary.n$smoke)
actuary.n

  name            gender age exams Q1 Q2 Q3 S        title   smoke weight
1 Embryo Luo      M      -1  10    10  9  9 9.333333 FSA     N     70
3 Peter Smith     M      22   0     4  5  5 4.666667 student Y     60
5 Angela Peterson F      30   6     8  8 10 8.666667 student N     60
6 Emily Johnston  F      42   7     9 10 10 9.666667 ASA     N     55
7 Barbara Scott   ?      29   5     8  9  7 8.000000 student N     50
8 Benjamin Eng    M      36   9     7  8  8 7.666667 ASA     Y     75
  genderSmoke
1 MN
3 MY
5 FN
6 FN
7 ?N
8 MY

In [69]:
# for loops
psum <- function(n) {
    s <- 0
    for (i in 1:n) {
       s <- s + i
    }
    return(s)
}

psum(10)

[1] 55